Repository: mozilla-l10n/mt-training-data
Catalog: dml/dml_pontoon.tmx
Source language: en_us
Languages: dml

source: Domain refers to the subject matter of the sentence. Currently, you can choose between:
dml: ڈومین جملہ تہ موضوع ساں مطلب درو تے، فی الحال تو مسومن تہ انتخاب کُرین بیئب۔

source: Donate
dml: عطیہ

source: Donate your voice
dml: تانو کاڻ عطیہ کُرے

source: Done
dml: با

source: Don't see your language on Common Voice yet?
dml: ژا تلی تاں باݜہ کامن وائسہ نی بینُم

source: Don’t see your language reflected in the Dataset? To request a language head over to our Languages page.
dml: بی تانو باݜہ ڈیٹاسٹہ نی بنہ بئی، باݜہ تہ درخواست تہ پرئی امونہ باݜہ تہ پیچہ کی یا

source: Don't wish to say
dml: کیہ گنن تہ خوہش نی درو

source: Download
dml: ڈاون لوڈ

source: Download Common Voice Data
dml: عام کاڻ تہ ڈیٹا ڈوان لوڈ کُرا

source: Download Data
dml: ڈیٹا ڈوان لوڈ کُرے

source: Download Dataset Bundle
dml: ڈیٹا سیٹ تہ بنڈل ڈوان لوڈ کُرے

source: Download { $language }
dml: ڈاون لوڈ{ $language }

source: Download Links
dml: لنک نم ڈاون لوڈ کُرا

source: Download My Data
dml: ما ڈیٹا ڈاون کؙرے

source: Download options for accessing Common Voice data
dml: عام کاڻ تہ ڈیٹا کی ویبیاں کی اختیارات ڈاون لوڈ کُرا

source: Download our voice datasets
dml: امونہ کاڻ تہ ڈیٹا سیٹ نم ڈاون لوڈ کُرا

source: Download profile data
dml: پروفال ڈیٹا ڈاون لوڈ کُرا

source: Download the Dataset
dml: ڈیٹا سیٹ ڈاون لوڈ کُرے

source: Download the Single Word Target Segment
dml: ایک لفظ ٹارگٹ سگمنٹ ڈاون لوڈ کُرا

source: Do you have ideas on how we can make the Common Voice dataset better? Let us know on Discourse
dml: میاں ملی کیہ خیال دورئی کامن وائس تہ ڈیٹا سیٹ ابُت کُرئیں کی۔ ام کی ڈسکورسہ کُھنڈا

source: Do you want to continue?
dml: تو کیہ جاری ساتن گٹِنپی

source: Do you want to Speak, Listen or both?
dml: تو کیہ کُھنڈن گٹنپ اُشتُرونن گٹِنپ یا دوئں

source: Drag and drop or <browseWrap>Browse</browseWrap>
dml: کھشائیا وعیا آں <browseWrap>براوز</browseWrap>

source: Drag your file here or <uploadButton>click to upload</uploadButton>
dml: تانو فائل ایا کی کھشایا یا<uploadButton> اپ لوڈہ کلک کُرا</uploadButton>

source: Drop file here to upload
dml: اپ لود کُرن تہ پرئی فائل ای وعیا

source: Duala
dml: دوالا

source: During contribution submission feedback will be skipped after clicking 'Submit'. Contribution will continue directly with the next set of 5 recordings or validations.
dml: حصہ ڇھارن تہ منورہ 'Submit' ݜا کلک کُرن تہ آݜنتہ رائے وعین یو ۔ شراکت سیدہ آڅا 5 ریکارڈنگ یا توثیق تہ سیٹ ملی جاری تھیو۔

source: Dutch
dml: ڈچ

source: Each entry in the dataset consists of a unique MP3 and corresponding text file. Many of the <b>{ $total }</b> recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help train the accuracy of speech recognition engines. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.
dml: ڈیٹا سیٹہ ہر اندراج ایک منفرد MP3 آں متعلقہ متن تہ فائلہ مشتمل تِھنا۔ تہ لے<b>{ $total }</b>ڈیٹا سیٹہ ریکارڈ بئیسن گھنٹہ نامہ ڈیمو گرافک ڈٰیٹا عمر، سیکس آں لہجہ ایس شامل تِِھنا۔ سے تقریر زانال انجن نم ساں سئی کُرنی کی ترتیب پرینہ مدد کُنا۔ ڈیٹا سیٹ فی الحال مشتمل درو<b>{ $total }</b></b>توثیق بئیسن گینٹہ نم<b>{ $languages }</b>باڜہ نامہ، مگر ائی ہمیشہ ورے کاڻ آں باݜہ نم شامل کُنُمہ۔ امونہ نظر ڇھارا<languagesLink>باڜہ نم تہ پھٹہ </languagesLink> باݜہ کی درخواست کُرن یا بہ تعاون کُرئیں کی

source: Eastern Huasteca Nahuatl
dml: مشرقی ہوساٹیسہ ناہوٹل

source: Eastern Min
dml: مشرِقی من

source: Eastern Penan
dml: مشرقی پینان

source: Easy
dml: اسکان

source: Ebrie
dml: ایبرِکنین

source: Edit
dml: ایڈٹ

source: Edit Profile
dml: ایڈیٹ پروفائل

source: Email
dml: ای میل

source: Email: <emailFragment>commonvoice@mozilla.com</emailFragment>
dml: ای میل<emailFragment>commonvoice@mozilla.com</emailFragment>

source: <emailFragment>Sign up</emailFragment> to our mailing list to learn how you can take part in campaigns, events and co-design features on Common Voice.
dml: یہ زانے کی امونہ میل تہ لسٹہ سائن این کُرا، تے بی عام کاڻ تہ مہمات، پروگرم آں مشترکہ ڈیزئین تہ خصوصیاتہ کنو بئی حصہ گین بئیبہ

source: Email is already used for a different account
dml: ای امیل اول تئں ایک مختلف اکاونٹہ کی استمل بیسن درو

source: Email Subscriptions
dml: ای میل سبسکرپشنز

source: Emakhuwa
dml: ایماخوا

source: English
dml: انگریزی

source: Enter Email to Download
dml: ای میل اینٹر کُرا ڈاون لوڈ کُرئیں کی

source: Enter email to send a sign up link
dml: سائن اپ لنک ڜیاں کی ای میل لکا

source: Enter your Country/Region of Residence
dml: تانوں ملک/رہائش تہ علاقہ درج کُرا

source: Enter your email
dml: تانوں ای میل انٹر کُرا

source: Enter your public domain sentence here
dml: تانوں عوامی ڈومین جملہ ایا لِکا

source: Enter your public domain sentences here
dml: تانوں عوامی ڈومین جملہ نم ایا لِکا

source: Error
dml: غلطی

source: Error adding sentence
dml: جملہ جمع کُرنہ خرابی

source: Error { $code }
dml: خرابی{ $code }

source: Error while playing audio file.
dml: یہ آڈیو فائل چلامہ تے خرابی آگا

source: Erzya
dml: ایرزیا

source: ESC
dml: ای ایس سی

source: Esperanto
dml: ایسپرانٹو

source: Estonian
dml: استونین

source: Eton
dml: ایٹن

source: Events
dml: واقعہ نم

source: Everyone
dml: ہر کُرئی

source: Ewe
dml: ایو

source: Ewondo
dml: ایونڈو

source: Example
dml: مِثل

source: Exit & Delete clips
dml: نیسے آں کلپ ڈیلیٹ کُرے

source: Explore the community and languages supported by Common Voice
dml: عام کاڻ ساں حمایت کُرال کمیونٹی آں باڜہ ساں جائزہ گیا

source: Failed to copy SHA256 Checksum
dml: SHA256 Checksum کاپی نہ با

source: Fang
dml: فنگ

source: Faroese
dml: فیروزسی

source: Female/Feminine
dml: ژامی/موئنث

source: Fewer than 15 words per sentence
dml: ہر جملہ پنچیش15 الفاظ تہ کم تھیبو

source: Fields marked with an asterisk (*) are required.
dml: اشتاری (*) تہ نشن ویلا خانہ ضروری درو۔

source: File is too large
dml: فائل لے بلو درو

source: File is too small
dml: فائل لے اُوچھوٹی درو

source: Finance
dml: فنانس

source: Find others who care. That could be universities, language schools, advocacy groups or data science communities. Reach out and explain clearly how they can help and why. <outreachTemplates>See our template outreach emails</outreachTemplates>.
dml: دڇھا ورے تیں یونیورسٹی، باݜہ تہ اسکول ، پوئی کرالگروپیا ڈیٹآا سائنس تہ ماݜ تیں مدد کرین بئین آں کو۔ امونہ ٹیمپلیٹ دڇھا ای میلہ

source: Finish editing first?
dml: اول ترمیم ختُم کُرے

source: Finish recording
dml: ریکاڈنگ ختم کُرے

source: Finish recording first?
dml: پریݜبئیں ریکاڈنگ ختم کُرا

source: Finish Review
dml: جائزہ ختم کُرے

source: Finish validating
dml: توثیق ختم کُرا

source: Finish validating clips?
dml: کلپ ساں توثیق کُرن ختم کُرا

source: Finnish
dml: فنش

source: First, check if your language <languageLink>already exists</languageLink>. If it isn’t, you can <languageRequestLink>ask about adding your language</languageRequestLink>. There are two stages. Translating the site, and collecting sentences
dml: اول دڇھے تے تاں باݜہ اول تئیں دروئی۔ اگر نہ تھآ بہ تو تانو باݜہ شامل کُرئں کی پوچئین بئیپ۔ ماسہ دو حصہ درو۔ سائٹ تہ ترجمہ کُرن،آں جملہ سوتن

source: Follow guidelines from “What sentences can I add?”
dml: رہمنا اُصولہ ݜا عمل کُرا۔ تے ائی کیرا جملہ نم جمع کُرین بئیم

source: For every voice clip donated, and every audio clip validated, your account dashboards are updated to reflect your latest progress in each language you contribute to. Yes, you can contribute to more than one!<br/><br/> Use dashboards to track your stats, see how you're doing alongside others in the community, and set daily or weekly contribution goals.
dml: عطا کُریسن ہر ایک کاڻ تہ کلپ ساں توثیق کُریسن درو، تاں اکاونٹ تہ ڈش بورڈ اپ ڈیٹ کُرین ینا، یہ تہ پرئی تے تو کیرا ایس باڜا تعاون کُنپ سے باڜا تاں تازہ ترین پیش رفت ظاہر کُرین یو۔آں بی ایک تہ زیتہ تعاون کُرین بئیبہ<br/> <br/>ڈش بورڈ استعمل کُرا تانو سٹیٹس ٹریک کُرئیں کی، دڇھا تے بی کمیونٹی یہ ورے ملی کُنو کُری کرم کُنبہ آں بی روزانہ یا ہفتہ تہ ہدف مقرر کُرا

source: for example
dml: مثل تہ طورہ

source: For public domain text that is not available online, you could use academic referencing style e.g Harvard style "Jess (2021) My Public license poems"
dml: تئیں عوامی دساویزات تے کیرا ویب سائٹہ دستیاب نی درو، بی تعلیمی حوالہ پرین تہ انداز ہاورڈ سٹائل "Jess (2021) My Public license poems"

source: For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. For example, if we don't include any speakers with a particular accent, then the technology won't work well for people with that accent. <learnMore>Learn more about why metadata matters.</learnMore>
dml: ٹیکنالوجی ابُت طریقہ ہر کساں کی کرم کُرئیں کی، ڈیٹہ ڈیویلپرز ساں مدد کُنا کیرا مختلف قسم تہ ماڜ تھون بہ۔ مثال تہ طورہ، اگر اما ایک خاص لہجہ تہ باڜہ پریال شامل نی کُرومہ بہ،تا پھرکی ٹیکنالوجی تیں خاص لہجہ تہ ماڜہ کی سئی کرم نی کُرو،<learnMore> یہ تا بارہ ورے ایس زانا تہ میٹا ڈیٹا ساں اہمیٹ کو درو،</learnMore>

source: For these launched languages the website has been successfully <localizationGlossaryLink>localized</localizationGlossaryLink>, and has enough <sentenceCollectionGlossaryLink>sentences collected</sentenceCollectionGlossaryLink> to allow for ongoing <speakLink>Speak</speakLink> and <listenLink>Listen</listenLink> contributions.
dml: میں شروع کُریسن ویب سائٹ کامیابی ݜا تیار کُریسن درو<localizationGlossaryLink>لوکلائزڈ</localizationGlossaryLink>،آں کافی درو<sentenceCollectionGlossaryLink>جملہ نم جمع با</sentenceCollectionGlossaryLink> جاری ساتن تہ اجازت تہ پرئی<speakLink>مُشکُل بو</speakLink>آں<listenLink>اُشتُرونے</listenLink>شراکت نم،

source: Foundations
dml: فاونڈیشن نم

source: French
dml: فرانسیسی

source: Frisian
dml: فرسیئین

source: Fulah
dml: فولاہ

source: Fuzhou
dml: فوزو

source: Galician
dml: گالیشین

source: GB
dml: جی بی GB

source: General
dml: عام، جنرل

source: General language / multiple variants
dml: عام باڜہ/ لے قسم نم

source: Georgian
dml: جارجیائی

source: German
dml: جرمنِین

source: Get in touch
dml: رابطہ تھی

source: Get involved
dml: شامل بین

source: Get Involved
dml: حصہ گیا

source: Get started with goals
dml: مقصدہ ملی شُرُو کُرا

source: Get Started with Speech Recognition
dml: تقریر زانی شروع کُرے

source: Ghomala
dml: گومالہ

source: <githubLink>NVIDIA NeMo</githubLink>™ is an <docsLink>open-source toolkit</docsLink> for researchers developing state-of-the-art conversational AI models.
dml: <githubLink>NVIDIA NeMO</githubLink> درو ایک<docsLink>کولو سورس ٹول کٹ</docsLink>تحقیق کُرالہ کی جدید ترین مُشکُلہ مشتمل AIتیار کُنومہ

source: Goal reached
dml: منزل تلی ویبا

source: Goals
dml: مقصد نم

source: Goan Konkani
dml: گوان کونکی

source: Go to Discourse
dml: ڈسکورس کی یت

source: Go to Languages Page
dml: باݜہ تہ پھٹہ کی یت

source: Go to { $name }
dml: ترا کی یا{ $name }

source: <governanceLink>Read more about how we're governed</governanceLink>
dml: <governanceLink>یہ تہ بارہ ورے ایس مترا تے ائی کنو کُری حُمت کُنُمہ</governanceLink>

source: Governments
dml: حکومت نم

source: Grammatical / spelling error
dml: گرائمر/ املا تہ غلطی

source: Great! How many clips a week?
dml: ہفتا کتی کلپس نم ژُمئیمہ

source: Great! How many clips per day?
dml: ہر دیو کتی کلپس ژوپئیمہ

source: Great!<recordIcon></recordIcon> Record your next clip
dml: لے ابُت<recordIcon> </recordIcon> تانو آڅال کلپ ریکاڈ کُرے

source: Great work!<playIcon></playIcon> Listen again when you're ready
dml: لے ابُت کرم <playIcon></playIcon>پھرکی اُشتُرونا کیر بی تیار بوبہ

source: Greek
dml: یونانی

source: Gronings
dml: گرونگز

source: Guarani
dml: گورانی

source: Guidelines
dml: رہنما اصول

source: Gujarati
dml: گجراتی

source: Haitian
dml: ہیٹی

source: Hakha Chin
dml: ہکہ چِن

source: Hausa
dml: یاوسا

source: Have Feedback?
dml: کیہ رائے درو

source: Have you read our Terms?
dml: کیہ تو امُنہ شرط نم مترِتُھوپی؟

source: Having an account is not required to contribute, though it is helpful.
dml: حصہ ڇھارئیں کی اکاونٹ ضروری نی درو، حالانکہ یہ مدگار درو

source: Having a profile is not required to contribute though it is helpful, see why below.
dml: شراکت تہ پرئی پروفائل سا تھین ضروری نی درو۔ اگرچہ یہ مدد کُرین بیاں، بُن دڇھا تے کو۔

source: Healthcare
dml: صحت تہ خیال کُرن

source: Hebrew
dml: عبرانی

source: Help
dml: مددد

source: Help Common Voice reach { $hours } hours in a language with a personal goal
dml: کامن وائس ساں مدد کُرا ویبنہ { $hours }گینٹہ نامہ ایک باݜہ ایک ذاتی مقصدہ ملی

source: Help create Common Voice’s first target segment in { $locale }
dml: کامن وائس تہ اول ہدف تہ حصہ ژوپنہ مدد کُرا{ $locale }

source: Help reach { $hours } hours in { $language } with a personal goal
dml: ویبنہ مدد کُرا{ $hours } گینٹہ نامہ{ $language } ذاتی مقصدہ ملی

source: Help teach machines how real people speak, donate your voice at { $link }
dml: مشین نم ساں کُرا تہ انسانان کنو کُری مُشکُل بِن، تانوں کاڻ عطیہ کُرا ایا{ $link }

source: Help us build a community around voice technology, stay in touch via email.
dml: کاڻ تہ ٹیکنالوجی تہ برادری ژوپنہ امونہ مدد کُرا۔ ای میل تہ زریعہ اما ملی تِھیا

source: Help us build a high quality, publicly open dataset
dml: ایک اعلی معیار تہ عوامی کولاو ڈیٹا سیٹ ژُپنہ اماں ملی مدد کُرا

source: Help us find more voices, share your goal
dml: ورے کاڻ سوتنہ اماملی مدد کُرا، تانوں مقصد شیئر کُرا

source: Help us find others to donate their voice!
dml: تانوں کاڻ مئی پریال ماڜ پیدا کُرنہ امونہ مدد کُرا

source: Help us get to { $goal }
dml: حاصل کُرئں کی امُنہ مدد کُرا{ $goal }

source: Help us validate sentences!
dml: جُملہ نم زیت کُرئں کی امُنہ مدد کُرا

source: Help us validate voices
dml: کاݨ نم تہ تصدیق کُرنہ امونہ مدد کُرانؙا

source: Heng Hua
dml: ہینگ ہوا

source: Here are the links to download your ZIP files.
dml: تاں زپ فائل نم ڈاون لوڈ کُرئں کی لنک نم یہ درو۔

source: Hidden
dml: ولیسن

source: Highland Puebla Nahuatl
dml: ہائی لینڈ پُیو نھاتی

source: Hiligaynon
dml: ہیلیگینون

source: Hill Mari
dml: ہل ماری

source: Hindi
dml: ہندی

source: His hand was rais-ed.
dml: تساں دش ملوٹہ درو

source: History, Law and Government
dml: تاریخ،قانون آں حکومت

source: Hours
dml: گینٹہ نم

source: Hours Recorded
dml: گینٹہ نم ریکارڈ کُرین گا

source: Hours Validated
dml: گینٹہ نم ساں توثیق کُرین گا

source: How ?
dml: کنو بئی

source: How are project decisions made?
dml: پراجیکٹہ بحث کنو کری کرین ینا؟

source: How can we effectively grow a language on Common Voice?
dml: ائی عام کاݩہ لے ابُت طریقا باڜہ کنو کُرئ زیت کُرین بئیمہ

source: How does Common Voice work?
dml: عامل کاݩ کنو بئی کرم کُنا

source: How does site localization work?
dml: سائٹ لوکلایزیش کنو کُری کرم کُنا

source: How do I access and use the dataset?
dml: ائی کنو کری ڈیٹہ سیٹ استعمل آں گین بئیم

source: How do I add a language?
dml: ائی باݜہ کنو کُری شامل کُریم

source: How do I add sentences?
dml: ائی کنو کُری جملہ شامل کُریم

source: How do I cite?
dml: ائی کنو کُری حوالہ پریم

source: How do I know whether to approve a voice clip?
dml: موکی کنو بئی پتہ بو کاݩ تہ کلپ منظور گنی

source: How do I record a high quality voice clip?
dml: ائی کنو کُری یک لے ابُت کوالٹی تہ کاݩ تہ کلپ ریکڈ کرین بئیم

source: How do I stay in touch?
dml: ائی کنو بئی رابطا تھیم

source: How is Common Voice funded?
dml: کامن وائس ساں مالی مدد کنو بئی کُرین ینہ؟

source: How Spontaneous Speech works
dml: بے ساختہ تقریر کنو بئی کرم کُنا

source: How to add multiple sentences
dml: لے جملہ نم کنو کُری شامل کُریمہ

source: How would you describe your accent?
dml: تا تانوں لہجہ کنو کؙری بین کؙنپ؟

source: How would you describe your sex or gender?
dml: تو کنو کُری تانوں جنس یا جنس تہ وضاحت کُریس

source: Hungarian
dml: ہنگرین

source: I agree
dml: ائی مننُم

source: I agree to Common Voice's <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
dml: ائی کامن وئس ملی متفق <termsLink>شرائط</termsLink> آں <privacyLink> پرائویسی نوٹس</privacyLink>

source: Ibibio
dml: ایبیبیو

source: Icelandic
dml: آئس لیندی

source: I confirm that these sentence are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
dml: ائی تصدیق کُنُم تہ میں جملہ نم <wikipediaLink> عوامی ڈومین </wikipediaLink> آں موکی مسو اپ لود کُرن تہ اجازت درو

source: I confirm that this sentence is <wikipediaLink>public domain</wikipediaLink> and I have permission to upload it.
dml: ائی تصدیق کُنُم تے یہ جملہ <wikipediaLink> عوامی ڈومین درو</wikipediaLink> آں موکی اجازت درو مس اپ لود کُرئیں تہ

source: <icon></icon> Add multiple public domain sentences
dml: <icon> </icon> لے عوامی ڈومین جملہ نم شامل کُرے

source: Ideally natural and conversational (it should be easy to read the sentence)
dml: مثل تہ طورہ فطری آں مُشکُل(یہ جملہ مترنہ اسکان تھیبو)

source: I'd like to receive emails such as goal reminders, my progress updates and newsletters about Common Voice.
dml: ائی منو ای میل گیم تے کیرا مقصد تہ یاددہانی، ما مُکھ بئیں ین تہ معلومات آں کامن وائس تہ خبر تہ خط تھیو

source: I do not agree
dml: ائی نی منُم

source: If a clip is rejected by 2 people, it is released in a different subset of the dataset.
dml: اگتر کلپ دد ماݜے نہ منین بہ، یہ ایک ورے ڈیٹہ ورے سرنامہ ملی ریلیز بیاں

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
dml: اگر یہ مینہ تانوں الفاط درو بہ،صرف گنا<italicizedText>تانئی حوالہ</italicizedText> اما کی یہ زانن ضروری درو تے میا کی یہ مواد کا تہ میلو با تے ائی مس دڇھمہ تے یہ عوامی ڈومینہ درو آں کاپی تہ اجازت تہ کیہ پابندی مس ڜا نی لگینا۔ حوالہ تہ بارہ ورے معلومت تہ پرئی امونہ <guidelinesLink>رہنما اُصول تہ پھٹ</guidelinesLink>

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
dml: اگر ریکارڈنگ چھنا بہ یا بہ زیگا بہ تس مسترد کُرا، اگر سئی بئی اُشترنن بڜ تھا بہ پھرکی مہ مسترد کُرا

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
dml: اگر بی یہ فائل تہ بارہ اضافی معلومت پرین گٹینبہ بہ، پھرکی مہربانی کُری رابطہ کُرا<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
dml: اگر بی یہ فائل تہ بارہ اضافہ معلومت پرینبہ بہ کیرا ٹمپلیٹہ شامل نی درو، مہربانی کُری رابطہ کُرا<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If the sentence does not meet the above criteria, click the "No" button.
dml: اگر جملہ پچو پریسن معیارہ پورہ درو بہ تا "نی" تہ بٹنہ کلک کُرا۔

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
dml: اگر جملہ معارہ پور نی درو بہ،کھوڜنتی بئیں نامنظور تہ بٹنہ کلک کُرا۔ اگر توجملہ پوئی نی بئینپ بہ، تو مس وعین بئینپ آں مُکھ بئیں ورے کی ین بئینپ

source: If the sentence is offensive or upsetting - for example because of explicit content, or another violation of our <communityGuidelines>community participation guidelines</communityGuidelines> - you should reject the sentence. You can also reach out to us at <emailFragment>commonvoice@mozilla.com</emailFragment> to escalate the issue.
dml: اگر جملہ ناگوار یا تکلیف دہ درو با، مثلا فحش مواد تہ وجہ یا امونی<communityGuidelines> کمیونٹی تی شراکت ہ ہدایات</communityGuidelines>تہ خلاف ورزی تہ وجہ، تاں میاکی جملہ مسترد کُرن پکار درو، بی زیت کُرن کی اما ملی<emailFragment>commonvoice@mozilla.com</emailFragment> رابطہ کُرین بیبہ۔

source: If the sentence meets the criteria above, click the "Yes" button.
dml: اگر جملہ پچو پریسن معیارہ پورہ درو بہ تا "آں" تہ بٹنہ کلک کُرا۔

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
dml: اگر جملہ معیارہ پورہ درو بہ، دڇھنی بئیں منظور تہ بٹہ کلک کُرا

source: If you are unsure about the sentence, you may also skip it and move on to the next one.
dml: اگر تو کی جملہ تہ برا یقین نی درو بہ ، تا پھرکی مس وعی مُکھبئیں جملہ کی ین بیبہ۔

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
dml: اگر میاکی منو کیہ شئی بِنوبہ، تے سے میں ہدایاتہ شامل نی درو بہ۔ مہربانی کُری تانئی ابُت سوچ کُرا فیصلہ کُرا. اگر بی پھرکی ایس فیصلہ نی کُرین بیبہ تا پھرکی اسکیپ بٹن کُرا آں ورے ریکارڈنگ کی یا۔

source: If you could <strong>hear them</strong> and <strong>understand them</strong>, it’s usually <strong>best to approve</strong>.
dml: اگر بی <strong>تسو اشترونین بیبہ </strong>آں <strong>زانین بیبہ،</strong> یہ عام طورہ<strong> لے ابُت درو منظور کرین کی</strong>

source: If you don’t hear from us within a couple of days, reach out at <emailLink>{ $email }</emailLink> and we’ll get back to you!
dml: اگر میاکی اک کتکی باس تلی اما تہ جواب میلو نی با بہ،کی ویبا<emailLink>{ $email }</emailLink> تا ائی ملی پھرکی رابطہ کُریمہ!

source: If you or your organisation would like to contribute back to the project, you can make a <donateLink>donation</donateLink> or reach out to our partnerships team on <emailFragment>commonvoice@mozilla.com</emailFragment>.
dml: اگر بی یا مینہ تنظیم یہ پرجیکٹہ دوبارہ تعاوں کُرن گٹینبہ، بی ایک ژوپئین بئیبہ <donateLink>چندہ</donateLink> یا امونہ شراکت دار ٹیمہ کی ویبا<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If you’re having trouble contributing, you can switch back to seeing all content for your language at any time.
dml: اگر میاکی تعاون کُرنہ پریشانی دور بیاں بہ، تا بی کیہ ایس وخ تانوں باݜہ تہ مواد دڇھئیں کی پھرکی ین بئیبہ۔

source: If you’re looking for tools to build ASR models, you can connect to other people in the community <discourseLink>on Discourse</discourseLink>.
dml: اگر تو ٹول ASR ماڈل ژوپئیں کی دڇھنپ بہ، بی کمیونٹی یہ امونہ باݜہ ملہ رابطہ کرُین بئیبہ<discourseLink> ڈسکورس ݜا</discourseLink>۔

source: If you're looking to speak more about the dataset, want to co-invest in planned platform expansions or look for collaboration opportunities, <emailFragment>drop us a line.</emailFragment>
dml: اگر بی ڈیٹا سیٹ تہ بارہ ورے مُشکُل بین گٹنبہ،منصوبہ بندی بئسن پلیٹ فام ساں توسیعہ شریک سرمایہ کاری کُنبہ، یا تعاون تہ موقع نم ویچنبہ بہ تا<emailFragment>ام ملی رابطہ کُرا</emailFragment>

source: If you run out of sentences to review, please help us collect more sentences!
dml: اگر توملی جائزہ کی جملہ نم ختم بابہ، مہربانی کُری اما ملی ورے جملہ نم سوتنہ مدد کُرے

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
dml: اگر مینہ خیالہ تلفظ منے بئی ژوپینا<strong> یہ زانن ناممکن درو</strong>،آں ترا ایک<strong> ڈنگپچھمبئی لے شور درو</strong>،یا تہ ترا<strong>ورے ماݜ ایس مُشکُل بین</strong>، تاں بی کلپ مسترد کُرا۔<accuracyLink>امونہ سئی کُرن تہ معیارہ ورے ایس دڇھا</accuracyLink>۔

source: Igbo
dml: اگبو

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
dml: ژا کامن وائس کی ما کاڻ عطیہ کُرن زاتی مقصد درو، مو ملی شامل با آں مشین نامہ کڅنہ مدد کُرا تے انسان کنو بئی مُشکُل بین{ $link }

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
dml: موکی کیہ تلیف نی درو تاں یہ معلومات ہینڈل کؙرنہ تو پوئی کؙروپ موزیلا ساں <privacyLink> پرائویسی پالیسی</privacyLink>

source: Include appropriate citation
dml: مناسب حوالہ شامل کُرا
